app/controllers/spots_controller.rb

SELECT "spots".* FROM "spots"
---
  def index
    @spots  = Spot.all

SELECT "spots".* FROM "spots" WHERE ("spots"."id" = 1) LIMIT 1
---
  def show
    @spot = Spot.find(params[:id])

INSERT INTO "spots" ("name", "created_at", "updated_at", "longitude", "latitude") VALUES ('myspot', '2011-03-17 18:15:33.305635', '2011-03-17 18:15:33.305635', 23.0, 23.0)
---
  def create
    @spot = Spot.new(params[:spot])
    if @spot.save

SELECT "spots".* FROM "spots" WHERE ("spots"."id" = 1) LIMIT 1
INSERT INTO "paintings" ("spot_id", "name", "description", "created_at", "updated_at", "image") VALUES (NULL, NULL, NULL, '2011-03-17 21:18:03.587303', '2011-03-17 21:18:03.587303', 'armiestactics.txt')
---
  def ddupload
    spot = Spot.find(params[:id])
    paint = spot.paintings.build(:image => params[:file])
    paint.save